import GetDataWialon
import json

car = 21462723
# 19574141
timefrom = "05-10-2020"
timeto = "05-10-2020"
# timeto = "20-04-2020"

tfrom = GetDataWialon.time_convert(timefrom, 0)
tto = GetDataWialon.time_convert(timeto, 1)

#un = GetDataWialon.get_data_cars(car,timefrom,timeto)
#print(un)

un = ({'reportResult': {'msgsRendered': 1, 'stats': [['Отчет', 'Отчет с топливом и моточасами(ДУТ)'], ['Объект', 'В 257 ЕМ 136 Лада Ларгус'], ['Начало интервала', '2020-10-05 00:00:01'], ['Окончание интервала', '2020-10-05 23:59:59'], ['Ср. расход', '8898847.71 l/100 km'], ['Потрачено топлива по ДУТ', '6.70 l'], ['Потрачено топлива в поездках', '5147663.41 l'], ['Нач. уровень', '18.64 l'], ['Конеч. уровень', '11.94 l'], ['Пробег', '58.19 km'], ['Время в движении', '2:16:33'], ['Моточасы', '2:18:09'], ['Всего заправок', '0'], ['Всего заправлено', '0.00 l'], ['Всего сливов', '0'], ['Всего топлива слито', '0.00 l'], ['Макс. скорость в поездках', '72 km/h'], ['Средняя скорость в поездках', '26 km/h'], ['Количество стоянок', '6'], ['Продолжительность стоянок', '21:42:33'], ['Оценка качества вождения (1 плохо, 6 хорошо)', '5.9'], ['Потрачено по ДАРТ', '0.00 l'], ['Потрачено по ДАРТ в движении', '0.00 l'], ['Потрачено по ДАРТ без движения', '0.00 l'], ['Ср. расход по ДАРТ', '0.00 l/100 km'], ['Ср. обороты двигателя', '1404'], ['Макс. обороты двигателя', '2906'], ['Потрачено по ДАРТ на холостом ходу', '0.00 l'], ['Потрачено по ДАРТ в поездках', '0.00 l'], ['Ср. пробег по ДАРТ в поездках на единицу топлива', '0.00 km']], 'tables': [{'name': 'unit_generic', 'label': 'Отчет по дням', 'grouping': {'type': 'day'}, 'flags': 4369, 'rows': 1, 'level': 2, 'columns': 14, 'header': ['№', 'Grouping', 'Пробег в поездках', 'Ср. скорость', 'Макс. скорость', 'Время в движении', 'Моточасы', 'Стоянки', 'Потрачено по ДУТ', 'Ср. расход по ДУТ', 'Всего заправок', 'Всего сливов', 'Заправлено', 'Слито'], 'header_type': ['', '', 'mileage', 'avg_speed', 'max_speed', 'in_motion', 'eh', 'duration_stay', 'fuel_consumption_fls', 'avg_fuel_consumption_fls', 'fillings_count', 'thefts_count', 'filled', 'thefted'], 'total': ['', 'Total', '58.19 km', '2 km/h', '72 km/h', '2:16:33', '2:18:09', '21:42:33', '6.70 l', '11.51 l/100 km', '0', '0', '0.00 l', '0.00 l'], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 58194.7895598, 'vt': 10}, {'v': 2.42629933541, 'vt': 20}, {'v': 72, 'vt': 20}, {'v': 8193, 'vt': 40}, {'v': 8289, 'vt': 40}, {'v': 78153, 'vt': 40}, {'v': 6.69902992249, 'vt': 50}, {'v': 11.5113912657, 'vt': 51}, {'v': 0, 'vt': 2}, {'v': 0, 'vt': 2}, {'v': 0, 'vt': 50}, {'v': 0, 'vt': 50}]}, {'name': 'unit_ecodriving', 'label': 'Качество вождения', 'grouping': {'sortColumn': 5, 'type': 'criterion'}, 'flags': 4496, 'rows': 1, 'level': 2, 'columns': 11, 'header': ['№', 'Grouping', 'Время нарушения', 'Положение', 'Значение', 'Ср. скорость', 'Макс. скорость', 'Штраф', 'Оценка', 'Кол-во', 'Водитель'], 'header_type': ['', '', 'time_begin', 'location', 'violation_value', 'avg_speed', 'max_speed', 'violation_mark', 'violation_rank', 'violations_count', 'driver'], 'total': ['', 'Total', '2020-10-05 02:09:02', 'Волгоград, Им. Качалова ул., 39А', '', '26 km/h', '72 km/h', '7', '5.9', '4', ''], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 1601863742, 'vt': 30}, {'v': 0, 'vt': 1}, {'v': 0, 'vt': 0}, {'v': 25.5707607, 'vt': 20}, {'v': 72, 'vt': 20}, {'v': 6.87346759092, 'vt': 110}, {'v': 5.9, 'vt': 111}, {'v': 4, 'vt': 2}, {'v': -348201.3876, 'vt': 0}]}, {'name': 'unit_trips', 'label': 'Поездки', 'grouping': {'type': 'day'}, 'flags': 4497, 'rows': 1, 'level': 2, 'columns': 20, 'header': ['№', 'Grouping', 'Начало', 'Конец', 'Нач. положение', 'Конеч. положение', 'Длительность', 'Пробег', 'Потрачено по ДУТ', 'Нач. уровень', 'Конеч. уровень', 'Количество поездок', 'Ср. скорость', 'Макс. скорость', 'Водитель', 'Ср. обороты двигателя', 'Макс. обороты двигателя', 'Потрачено по ДАРТ', 'Ср. расход по ДАРТ', 'Ср. расход на холостом ходу по ДАРТ'], 'header_type': ['', '', 'time_begin', 'time_end', 'location_begin', 'location_end', 'duration', 'mileage', 'fuel_consumption_fls', 'fuel_level_begin', 'fuel_level_end', 'trips_count', 'avg_speed', 'max_speed', 'driver', 'avg_engine_rpm', 'max_engine_rpm', 'fuel_consumption_abs', 'avg_fuel_consumption_abs', 'avg_fuel_consumption_idle_abs'], 'total': ['', 'Total', '02:09:02', '15:43:26', 'Волгоград, Им. Качалова ул., 39А', 'Волгоград, Им. Качалова ул., 39А', '2:16:33', '58.19 km', '6.41 l', '18.64 l', '11.94 l', '5', '26 km/h', '72 km/h', '', '1405', '2906', '0.00 l', '0.00 l/100 km', '0.00 l/h'], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 1601863742, 'vt': 31}, {'v': 1601912606, 'vt': 31}, {'v': 0, 'vt': 1}, {'v': 0, 'vt': 1}, {'v': 8193, 'vt': 40}, {'v': 58194.7895598, 'vt': 10}, {'v': 6.41036128998, 'vt': 50}, {'v': 18.6407775879, 'vt': 54}, {'v': 11.9417476654, 'vt': 54}, {'v': 5, 'vt': 2}, {'v': 25.5707607, 'vt': 20}, {'v': 72, 'vt': 20}, {'v': -348201.3876, 'vt': 0}, {'v': 1405.50598802, 'vt': 2}, {'v': 2906, 'vt': 2}, {'v': 0, 'vt': 50}, {'v': 0, 'vt': 51}, {'v': 0, 'vt': 52}]}, {'name': 'unit_engine_hours', 'label': 'Моточасы', 'grouping': {'type': 'day'}, 'flags': 4496, 'rows': 1, 'level': 2, 'columns': 12, 'header': ['№', 'Grouping', 'Начало', 'Нач. положение', 'Конец', 'Конеч. положение', 'В движении', 'Холостой ход', 'Пробег', 'Потрачено по ДУТ', 'Моточасы', 'Потрачено по ДУТ на холостом ходу'], 'header_type': ['', '', 'time_begin', 'location_begin', 'time_end', 'location_end', 'duration_move', 'duration_stay', 'mileage', 'fuel_consumption_fls', 'duration', 'fuel_avg_consumption_fls_idle'], 'total': ['', 'Total', '02:09:02', 'Волгоград, Им. Качалова ул., 39А', '15:47:08', 'Волгоград, Им. Качалова ул., 39А', '1:55:47', '0:22:22', '58.13 km', '7.20 l', '2:18:09', '0.00 l'], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 1601863742, 'vt': 31}, {'v': 0, 'vt': 1}, {'v': 1601912828, 'vt': 31}, {'v': 0, 'vt': 1}, {'v': 6947, 'vt': 40}, {'v': 1342, 'vt': 40}, {'v': 58125.5085859, 'vt': 10}, {'v': 7.19942569733, 'vt': 50}, {'v': 8289, 'vt': 40}, {'v': 0, 'vt': 50}]}, {'name': 'unit_stops', 'label': 'Остановки менее 5 минут', 'grouping': {'type': 'day'}, 'flags': 4369, 'rows': 1, 'level': 2, 'columns': 7, 'header': ['№', 'Grouping', 'Начало', 'Конец', 'Длительность', 'Положение', 'Общее время'], 'header_type': ['', '', 'time_begin', 'time_end', 'duration', 'location', 'duration_ival'], 'total': ['', 'Total', '03:07:44', '15:39:53', '0:10:46', '', '12:32:09'], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 1601867264, 'vt': 31}, {'v': 1601912393, 'vt': 31}, {'v': 646, 'vt': 40}, {'v': -348201.3876, 'vt': 0}, {'v': 45129, 'vt': 40}]}, {'name': 'unit_stays', 'label': 'Стоянки свыше 30 минут', 'grouping': {'type': 'day'}, 'flags': 4368, 'rows': 1, 'level': 2, 'columns': 7, 'header': ['№', 'Grouping', 'Начало', 'Конец', 'Длительность', 'Положение', 'Кол-во'], 'header_type': ['', '', 'time_begin', 'time_end', 'duration', 'location', 'stays_count'], 'total': ['', 'Total', '00:00:02', '23:59:08', '21:42:33', '', '6'], 'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': 1601856002, 'vt': 31}, {'v': 1601942348, 'vt': 31}, {'v': 78153, 'vt': 41}, {'v': -348201.3876, 'vt': 0}, {'v': 6, 'vt': 2}]}], 'attachments': [{'name': 'График уровня топлива', 'type': 'chart', 'datasets': ['Обработанный уровень топлива'], 'axis_y': ['Volume, litres'], 'axis_x': 'Time', 'flags': 20, 'p': {'chart_markers': {'f': 488}, 'sensor_mask': '*', 'chart_regions': [{'id': 'chart_trips_regions', 'color': 16425607, 'priority': 5, 'name': 'Поездки'}, {'id': 'chart_engine_hours_regions', 'color': 15913020, 'priority': 4, 'name': 'Моточасы'}, {'id': 'chart_stays_regions', 'color': 16773056, 'priority': 3, 'name': 'Стоянки'}]}}, {'name': 'График расхода топлива/скорости', 'type': 'chart', 'datasets': ['Уровень топлива', 'Скорость, km/h'], 'axis_y': ['Volume, litres', 'Speed, km/h'], 'axis_x': 'Time', 'flags': 20, 'p': {'sensor_mask': '*', 'chart_markers': {'f': 488}, 'chart_regions': [{'id': 'chart_engine_hours_regions', 'color': 15325990, 'priority': 5, 'name': 'Моточасы'}, {'id': 'chart_stays_regions', 'color': 16773056, 'priority': 4, 'name': 'Стоянки'}, {'id': 'chart_trips_regions', 'color': 16090467, 'priority': 3, 'name': 'Поездки'}]}}, {'name': 'График расхода топлива/высота на уровнем моря', 'type': 'chart', 'datasets': ['Высота, m', 'Расход топлива по ДУТ'], 'axis_y': ['Altitude, m', 'Consumption, l/h'], 'axis_x': 'Time', 'flags': 20, 'p': {'sensor_mask': '*', 'chart_markers': {'f': 488}, 'chart_regions': [{'id': 'chart_engine_hours_regions', 'color': 15983910, 'priority': 5, 'name': 'Моточасы'}, {'id': 'chart_trips_regions', 'color': 16223339, 'priority': 4, 'name': 'Поездки'}, {'id': 'chart_stays_regions', 'color': 16773056, 'priority': 3, 'name': 'Стоянки'}]}}, {'name': 'График напряжения бортовой сети', 'type': 'chart', 'datasets': ['Напряжение'], 'axis_y': ['Voltage, V'], 'axis_x': 'Time', 'flags': 20, 'p': {'sensor_mask': '*', 'chart_markers': {'f': 160}, 'chart_regions': [{'id': 'chart_engine_hours_regions', 'color': 15852328, 'priority': 5, 'name': 'Моточасы'}, {'id': 'chart_stays_regions', 'color': 16773056, 'priority': 4, 'name': 'Стоянки'}, {'id': 'chart_trips_regions', 'color': 16086349, 'priority': 3, 'name': 'Поездки'}]}}]}, 'reportLayer': {'name': 'report unit_msgs', 'bounds': [48.6963272095, 44.4389038086, 48.797454834, 44.5468978882], 'units': [{'id': 21462723, 'msgs': {'count': 1453, 'first': {'time': 1601856002, 'lat': 48.7723884583, 'lon': 44.5395965576}, 'last': {'time': 1601942348, 'lat': 48.7723693848, 'lon': 44.5396308899}}, 'mileage': 58194.7895598, 'max_speed': 72}]}, 'layerCount': 3}, [{'n': 0, 'i1': 0, 'i2': 1452, 't1': 1601856002, 't2': 1601942348, 'd': 1, 'c': ['1', '2020-10-05', '58.19 km', '2 km/h', {'t': '72 km/h', 'y': 48.7497383144, 'x': 44.469973297}, '2:16:33', '2:18:09', '21:42:33', '6.70 l', '11.51 l/100 km', '0', '0', '0.00 l', '0.00 l'], 'r': [{'n': 0, 'i1': 0, 'i2': 1452, 't1': 1601856002, 't2': 1601942348, 'd': 0, 'c': ['1.1', '2020-10-05 00:00:02', '58.19 km', '2 km/h', {'t': '72 km/h', 'y': 48.7497383144, 'x': 44.469973297}, '2:16:33', '2:18:09', '21:42:33', '6.70 l', '11.51 l/100 km', '0', '0', '0.00 l', '0.00 l']}]}], [{'n': 0, 'i1': 43, 'i2': 1284, 't1': 1601863742, 't2': 1601912606, 'd': 4, 'c': ['1', 'Превышение: среднее', {'t': '2020-10-05 02:09:02', 'v': 1601863742, 'y': 48.7723883332, 'x': 44.53959833}, {'t': 'Волгоград, Им. Качалова ул., 39А', 'y': 48.7723883332, 'x': 44.53959833}, '', '26 km/h', '72 km/h', '7', '5.9', '4', ''], 'r': [{'n': 0, 'i1': 186, 'i2': 190, 't1': 1601867041, 't2': 1601867088, 'd': 0, 'c': ['1.1', '2020-10-05 03:04:01', {'t': '2020-10-05 03:04:01', 'v': 1601867041, 'y': 48.7637799929, 'x': 44.5136583095}, {'t': 'Волгоград, 3-я Продольная Магистраль', 'y': 48.7637799929, 'x': 44.5136583095}, {'t': '10 km/h', 'y': 48.7631133173, 'x': 44.5121716532}, '66 km/h', '70 km/h', '100', '', '1', '']}, {'n': 1, 'i1': 462, 'i2': 480, 't1': 1601890521, 't2': 1601890763, 'd': 0, 'c': ['1.2', '2020-10-05 09:35:21', {'t': '2020-10-05 09:35:21', 'v': 1601890521, 'y': 48.751081661, 'x': 44.4726849684}, {'t': 'Волгоград, 3-я Продольная Магистраль', 'y': 48.751081661, 'x': 44.4726849684}, {'t': '12 km/h', 'y': 48.7497383144, 'x': 44.469973297}, '66 km/h', '72 km/h', '100', '', '1', '']}, {'n': 2, 'i1': 602, 'i2': 606, 't1': 1601892036, 't2': 1601892116, 'd': 0, 'c': ['1.3', '2020-10-05 10:00:36', {'t': '2020-10-05 10:00:36', 'v': 1601892036, 'y': 48.7092749911, 'x': 44.4422133138}, {'t': 'Волгоград, 3-я Продольная Магистраль', 'y': 48.7092749911, 'x': 44.4422133138}, {'t': '10 km/h', 'y': 48.7126783162, 'x': 44.4432483112}, '68 km/h', '70 km/h', '100', '', '1', '']}, {'n': 3, 'i1': 758, 'i2': 763, 't1': 1601903808, 't2': 1601903828, 'd': 0, 'c': ['1.4', '2020-10-05 13:16:48', {'t': '2020-10-05 13:16:48', 'v': 1601903808, 'y': 48.7848233266, 'x': 44.4741266557}, {'t': 'Городище, Баррикадная ул., 76', 'y': 48.7848233266, 'x': 44.4741266557}, {'t': '11 km/h', 'y': 48.7857133171, 'x': 44.4746832979}, '47 km/h', '51 km/h', '100', '', '1', '']}]}], [{'n': 0, 'i1': 43, 'i2': 1284, 't1': 1601863742, 't2': 1601912606, 'd': 5, 'c': ['1', '2020-10-05', {'t': '02:09:02', 'v': 1601863742, 'y': 48.7723883332, 'x': 44.53959833}, {'t': '15:43:26', 'v': 1601912606, 'y': 48.7723699978, 'x': 44.5396316481}, {'t': 'Волгоград, Им. Качалова ул., 39А', 'y': 48.7723883332, 'x': 44.53959833}, {'t': 'Волгоград, Им. Качалова ул., 39А', 'y': 48.7723699978, 'x': 44.5396316481}, '2:16:33', '58.19 km', '6.41 l', '18.64 l', '11.94 l', '5', '26 km/h', {'t': '72 km/h', 'y': 48.7497383144, 'x': 44.469973297}, '', '1405', '2906', '0.00 l', '0.00 l/100 km', '0.00 l/h'], 'r': [{'n': 0, 'i1': 43, 'i2': 93, 't1': 1601863742, 't2': 1601864005, 'd': 0, 'c': ['1.1', '2020-10-05 02:09:02', {'t': '02:09:02', 'v': 1601863742, 'y': 48.7723883332, 'x': 44.53959833}, {'t': '02:13:25', 'v': 1601864005, 'y': 48.773619991, 'x': 44.5410066574}, {'t': 'Волгоград, Им. Качалова ул., 39А', 'y': 48.7723883332, 'x': 44.53959833}, {'t': 'Волгоград, Качалова ул., 40', 'y': 48.773619991, 'x': 44.5410066574}, '0:04:23', '0.38 km', '0.87 l', '18.64 l', '17.77 l', '1', '5 km/h', {'t': '14 km/h', 'y': 48.7730983223, 'x': 44.5402916392}, '', '1077', '1744', '0.00 l', '0.00 l/100 km', '0.00 l/h']}, {'n': 1, 'i1': 109, 'i2': 249, 't1': 1601866387, 't2': 1601867647, 'd': 0, 'c': ['1.2', '2020-10-05 02:53:07', {'t': '02:53:07', 'v': 1601866387, 'y': 48.773619991, 'x': 44.5410066574}, {'t': '03:14:07', 'v': 1601867647, 'y': 48.783173328, 'x': 44.4677666352}, {'t': 'Волгоград, Качалова ул., 40', 'y': 48.773619991, 'x': 44.5410066574}, {'t': 'Городище, Прямая ул., 2', 'y': 48.783173328, 'x': 44.4677666352}, '0:21:00', '11.48 km', '0.00 l', '17.77 l', '19.22 l', '1', '33 km/h', {'t': '70 km/h', 'y': 48.7631133173, 'x': 44.5121716532}, '', '1535', '2684', '0.00 l', '0.00 l/100 km', '0.00 l/h']}, {'n': 2, 'i1': 376, 'i2': 681, 't1': 1601890009, 't2': 1601892942, 'd': 0, 'c': ['1.3', '2020-10-05 09:26:49', {'t': '09:26:49', 'v': 1601890009, 'y': 48.783173328, 'x': 44.4677666352}, {'t': '10:15:42', 'v': 1601892942, 'y': 48.7831166663, 'x': 44.4677732988}, {'t': 'Городище, Прямая ул., 2', 'y': 48.783173328, 'x': 44.4677666352}, {'t': 'Городище, Рабочая ул., 32', 'y': 48.7831166663, 'x': 44.4677732988}, '0:48:53', '27.23 km', '3.20 l', '18.93 l', '15.73 l', '1', '33 km/h', {'t': '72 km/h', 'y': 48.7497383144, 'x': 44.469973297}, '', '1543', '2701', '0.00 l', '0.00 l/100 km', '0.00 l/h']}, {'n': 3, 'i1': 743, 'i2': 969, 't1': 1601903604, 't2': 1601905303, 'd': 0, 'c': ['1.4', '2020-10-05 13:13:24', {'t': '13:13:24', 'v': 1601903604, 'y': 48.7831166663, 'x': 44.4677732988}, {'t': '13:41:43', 'v': 1601905303, 'y': 48.7715599916, 'x': 44.4829833099}, {'t': 'Городище, Рабочая ул., 32', 'y': 48.7831166663, 'x': 44.4677732988}, {'t': 'Волгоград, Кунцевская ул., 5', 'y': 48.7715599916, 'x': 44.4829833099}, '0:28:19', '9.46 km', '2.92 l', '15.44 l', '12.52 l', '1', '20 km/h', {'t': '60 km/h', 'y': 48.7904966596, 'x': 44.4820366577}, '', '1446', '2774', '0.00 l', '0.00 l/100 km', '0.00 l/h']}, {'n': 4, 'i1': 1001, 'i2': 1284, 't1': 1601910568, 't2': 1601912606, 'd': 0, 'c': ['1.5', '2020-10-05 15:09:28', {'t': '15:09:28', 'v': 1601910568, 'y': 48.7715599916, 'x': 44.4829833099}, {'t': '15:43:26', 'v': 1601912606, 'y': 48.7723699978, 'x': 44.5396316481}, {'t': 'Волгоград, Кунцевская ул., 5', 'y': 48.7715599916, 'x': 44.4829833099}, {'t': 'Волгоград, Им. Качалова ул., 39А', 'y': 48.7723699978, 'x': 44.5396316481}, '0:33:58', '9.65 km', '0.87 l', '12.81 l', '11.94 l', '1', '17 km/h', {'t': '65 km/h', 'y': 48.7704299853, 'x': 44.5193683134}, '', '1222', '2906', '0.00 l', '0.00 l/100 km', '0.00 l/h']}]}])

Unitsun = {'reportResult': {'msgsRendered': 1,
                            'stats': [['Отчет', 'Комплексный отчет (ООО ДЭП53)'],
                                      ['Объект', 'K784AB136 Камаз'],
                                      ['Начало интервала', '2020-04-20 00:00:01'],
                                      ['Конец интервала', '2020-04-20 23:59:59'],
                                      ['Нач. уровень', '148.81 l'],
                                      ['Конеч. уровень', '98.83 l'],
                                      ['Потрачено по ДУТ', '49.97 l'],
                                      ['Всего заправлено', '0.00 l'],
                                      ['Всего топлива слито', '0.00 l'],
                                      ['Пробег по всем сообщениям', '89.59 km'],
                                      ['Пробег в поездках', '88.39 km'],
                                      ['Ср. расход по ДУТ (весь пробег)', '55.78 l/100 km'],
                                      ['Ср. расход по ДУТ (пробег по детектору поездок)', '56.54 l/100 km'],
                                      ['Моточасы', '5:42:27'],
                                      ['Ср. расход по ДУТ в м/ч', '8.67 l/h'],
                                      ['Ср. расход по ДУТ в поездках', '51.15 l/100 km']],
                            'tables': [
        {'name': 'unit_stops', 'label': 'Остановки', 'grouping': {}, 'flags': 4112, 'rows': 5, 'level': 1, 'columns': 5,
         'header': ['№', 'Начало', 'Конец', 'Длительность', 'Положение'],
         'header_type': ['', 'time_begin', 'time_end', 'duration', 'location'],
         'total': ['', '2020-04-20 05:55:27', '2020-04-20 13:31:45', '0:06:27', ''],
         'totalRaw': [{'v': 0, 'vt': 0}, {'v': 1587362127, 'vt': 30}, {'v': 1587389505, 'vt': 30}, {'v': 387, 'vt': 40},
                      {'v': -348201.3876, 'vt': 0}]},
        {'name': 'unit_trips', 'label': 'Поездки', 'grouping': {}, 'flags': 4240, 'rows': 3, 'level': 1, 'columns': 9,
         'header': ['№', 'Начало', 'Конец', 'Длительность', 'Пробег', 'Ср. скорость', 'Макс. скорость','Нач. положение', 'Конеч. положение'],
         'header_type': ['', 'time_begin', 'time_end', 'duration', 'mileage', 'avg_speed', 'max_speed','location_begin', 'location_end'],
         'total': ['',
                   '2020-04-20 05:13:48',
                   '2020-04-20 13:34:46',
                   '1:44:46',
                   '88.39 km',
                   '51 km/h',
                   '88 km/h',
                   '20Н-9-23, Поворино',
                   '20Н-9-23, Поворино'],
         'totalRaw': [{'v': 0, 'vt': 0}, {'v': 1587359628, 'vt': 30}, {'v': 1587389686, 'vt': 30},
                      {'v': 6286, 'vt': 40}, {'v': 88392.7758779, 'vt': 10}, {'v': 50.6226524277, 'vt': 20},
                      {'v': 88, 'vt': 20}, {'v': 0, 'vt': 1}, {'v': 0, 'vt': 1}]},
        {'name': 'unit_stays', 'label': 'Стоянки', 'grouping': {}, 'flags': 4112, 'rows': 4, 'level': 1, 'columns': 5,
         'header': ['№', 'Начало', 'Конец', 'Длительность', 'Положение'],
         'header_type': ['', 'time_begin', 'time_end', 'duration', 'location'],
         'total': ['', '2020-04-20 04:07:08', '2020-04-20 13:41:12', '7:49:18', ''],
         'totalRaw': [{'v': 0, 'vt': 0}, {'v': 1587355628, 'vt': 30}, {'v': 1587390072, 'vt': 30},
                      {'v': 28158, 'vt': 40}, {'v': -348201.3876, 'vt': 0}]},
        {'name': 'unit_digital_sensors', 'label': 'Цифровые датчики',
         'grouping': {'sortColumn': 0, 'type': 'sensor_name'}, 'flags': 4368, 'rows': 1, 'level': 2, 'columns': 7,
         'header': ['№', 'Grouping', 'Датчик', 'Вкл.', 'Откл.', 'Длительность', 'Общее время'],
         'header_type': ['', '', 'sensor_name', 'time_begin', 'time_end', 'duration', 'duration_ival'],
         'total': ['', 'Total', '', '2020-04-20 04:07:08', '2020-04-20 13:38:46', '5:42:27', '9:31:38'],
         'totalRaw': [{'v': 0, 'vt': 0}, {'v': 0, 'vt': 0}, {'v': -348201.3876, 'vt': 0}, {'v': 1587355628, 'vt': 30},
                      {'v': 1587389926, 'vt': 30}, {'v': 20547, 'vt': 40}, {'v': 34298, 'vt': 40}]}], 'attachments': [
        {'name': 'График (ДУТ и Скорость)', 'type': 'chart',
         'datasets': ['Обработанный уровень топлива', 'Скорость, km/h'], 'axis_y': ['Volume, litres', 'Speed, km/h'],
         'axis_x': 'Time', 'flags': 20, 'p': {'chart_markers': {'f': 0}, 'chart_regions': [
            {'id': 'chart_engine_hours_regions', 'color': 16381105, 'priority': 5, 'name': 'Моточасы'}]}}]},
           'reportLayer': {'name': 'report unit_msgs',
                           'bounds': [51.2130584717, 42.0052223206, 51.5172271729, 42.2298774719], 'units': [
                   {'id': 19566586,
                    'msgs': {'count': 1247, 'first': {'time': 1587355628, 'lat': 51.2138748169, 'lon': 42.2290840149},
                             'last': {'time': 1587390072, 'lat': 51.2139930725, 'lon': 42.2291526794}},
                    'mileage': 88392.7758779, 'max_speed': 88}]}, 'layerCount': 2}
Stopsun = [{'n': 0, 'i1': 265, 'i2': 270, 't1': 1587362127, 't2': 1587362334, 'd': 0,
            'c': ['1', {'t': '2020-04-20 05:55:27', 'v': 1587362127, 'y': 51.3689975, 'x': 42.033565},
                  {'t': '2020-04-20 05:58:54', 'v': 1587362334, 'y': 51.36899, 'x': 42.0335775}, '0:03:27',
                  {'t': 'Р-22, 1.18 km from Теллермановский', 'y': 51.3689975, 'x': 42.033565}]},
           {'n': 1, 'i1': 374, 'i2': 374, 't1': 1587363467, 't2': 1587363467, 'd': 0,
            'c': ['2', {'t': '2020-04-20 06:17:47', 'v': 1587363467, 'y': 51.5168666667, 'x': 42.02714},
                  {'t': '2020-04-20 06:17:47', 'v': 1587363467, 'y': 51.5168666667, 'x': 42.02714}, '0:00:00',
                  {'t': 'Р-22, 2.28 km from Первомайского отделения совхоза "Грибановский"', 'y': 51.5168666667,
                   'x': 42.02714}]}, {'n': 2, 'i1': 979, 'i2': 982, 't1': 1587387281, 't2': 1587387401, 'd': 0,
                                      'c': ['3', {'t': '2020-04-20 12:54:41', 'v': 1587387281, 'y': 51.4221991667,
                                                  'x': 42.0127616667},
                                            {'t': '2020-04-20 12:56:41', 'v': 1587387401, 'y': 51.4221708333,
                                             'x': 42.012855}, '0:02:00',
                                            {'t': 'Р-22, 4.97 km from Грибановский', 'y': 51.4221991667,
                                             'x': 42.0127616667}]},
           {'n': 3, 'i1': 1082, 'i2': 1084, 't1': 1587388724, 't2': 1587388784, 'd': 0,
            'c': ['4', {'t': '2020-04-20 13:18:44', 'v': 1587388724, 'y': 51.2375258333, 'x': 42.0956825},
                  {'t': '2020-04-20 13:19:44', 'v': 1587388784, 'y': 51.2375241667, 'x': 42.0956716667}, '0:01:00',
                  {'t': 'Р-22, 1.61 km from Чибизовка', 'y': 51.2375258333, 'x': 42.0956825}]},
           {'n': 4, 'i1': 1196, 'i2': 1196, 't1': 1587389505, 't2': 1587389505, 'd': 0,
            'c': ['5', {'t': '2020-04-20 13:31:45', 'v': 1587389505, 'y': 51.216145, 'x': 42.2226691667},
                  {'t': '2020-04-20 13:31:45', 'v': 1587389505, 'y': 51.216145, 'x': 42.2226691667}, '0:00:00',
                  {'t': '20К-1-23, 2.58 km from Поворино', 'y': 51.216145, 'x': 42.2226691667}]}]
Tripsun = [{'n': 0, 'i1': 95, 'i2': 151, 't1': 1587359628, 't2': 1587360154, 'd': 0,
            'c': ['1', {'t': '2020-04-20 05:13:48', 'v': 1587359628, 'y': 51.2139133333, 'x': 42.2290358333},
                  {'t': '2020-04-20 05:22:34', 'v': 1587360154, 'y': 51.2337258333, 'x': 42.1445025}, '0:08:46',
                  '6.97 km', '48 km/h', {'t': '69 km/h', 'y': 51.23485, 'x': 42.1598583333},
                  {'t': '20Н-9-23, Поворино', 'y': 51.2139133333, 'x': 42.2290358333},
                  {'t': 'Рождественское, Грейдерная ул.', 'y': 51.2337258333, 'x': 42.1445025}]},
           {'n': 1, 'i1': 166, 'i2': 402, 't1': 1587360830, 't2': 1587363584, 'd': 0,
            'c': ['2', {'t': '2020-04-20 05:33:50', 'v': 1587360830, 'y': 51.2337075, 'x': 42.14451},
                  {'t': '2020-04-20 06:19:44', 'v': 1587363584, 'y': 51.5151, 'x': 42.0272733333}, '0:45:54',
                  '36.92 km', '48 km/h', {'t': '86 km/h', 'y': 51.4782616667, 'x': 42.0251525},
                  {'t': 'Рождественское, Грейдерная ул.', 'y': 51.2337075, 'x': 42.14451},
                  {'t': 'Р-22, 2.11 km from Первомайского отделения совхоза "Грибановский"', 'y': 51.5151,
                   'x': 42.0272733333}]}, {'n': 2, 'i1': 933, 'i2': 1236, 't1': 1587386680, 't2': 1587389686, 'd': 0,
                                           'c': ['3', {'t': '2020-04-20 12:44:40', 'v': 1587386680, 'y': 51.51505,
                                                       'x': 42.0272741667},
                                                 {'t': '2020-04-20 13:34:46', 'v': 1587389686, 'y': 51.2140308333,
                                                  'x': 42.2291741667}, '0:50:06', '44.50 km', '53 km/h',
                                                 {'t': '88 km/h', 'y': 51.4810183333, 'x': 42.0257516667}, {
                                                     't': 'Р-22, 2.10 km from Первомайского отделения совхоза "Грибановский"',
                                                     'y': 51.51505, 'x': 42.0272741667},
                                                 {'t': '20Н-9-23, Поворино', 'y': 51.2140308333, 'x': 42.2291741667}]}]
Staysun = [{'n': 0, 'i1': 0, 'i2': 95, 't1': 1587355628, 't2': 1587359628, 'd': 0,
            'c': ['1', {'t': '2020-04-20 04:07:08', 'v': 1587355628, 'y': 51.2138766667, 'x': 42.229085},
                  {'t': '2020-04-20 05:13:48', 'v': 1587359628, 'y': 51.2139133333, 'x': 42.2290358333}, '1:06:40',
                  {'t': '20Н-9-23, Поворино', 'y': 51.2138766667, 'x': 42.229085}]},
           {'n': 1, 'i1': 151, 'i2': 166, 't1': 1587360154, 't2': 1587360830, 'd': 0,
            'c': ['2', {'t': '2020-04-20 05:22:34', 'v': 1587360154, 'y': 51.2337258333, 'x': 42.1445025},
                  {'t': '2020-04-20 05:33:50', 'v': 1587360830, 'y': 51.2337075, 'x': 42.14451}, '0:11:16',
                  {'t': 'Рождественское, Грейдерная ул.', 'y': 51.2337258333, 'x': 42.1445025}]},
           {'n': 2, 'i1': 402, 'i2': 933, 't1': 1587363584, 't2': 1587386680, 'd': 0,
            'c': ['3', {'t': '2020-04-20 06:19:44', 'v': 1587363584, 'y': 51.5151, 'x': 42.0272733333},
                  {'t': '2020-04-20 12:44:40', 'v': 1587386680, 'y': 51.51505, 'x': 42.0272741667}, '6:24:56',
                  {'t': 'Р-22, 2.11 km from Первомайского отделения совхоза "Грибановский"', 'y': 51.5151,
                   'x': 42.0272733333}]}, {'n': 3, 'i1': 1236, 'i2': 1246, 't1': 1587389686, 't2': 1587390072, 'd': 0,
                                           'c': ['4', {'t': '2020-04-20 13:34:46', 'v': 1587389686, 'y': 51.2140308333,
                                                       'x': 42.2291741667},
                                                 {'t': '2020-04-20 13:41:12', 'v': 1587390072, 'y': 51.2139941667,
                                                  'x': 42.2291508333}, '0:06:26',
                                                 {'t': '20Н-9-23, Поворино', 'y': 51.2140308333, 'x': 42.2291741667}]}]



# Выбор мест назначения
for item in Tripsun:
    # Поездки
    print(item['c'][7]['t'])
    # # Прибытие
    print(item['c'][1]['t'])
    # Убытие
    print(item['c'][2]['t'])

# Выбор таблиц из отчета
# TODO *un заменить на значение метода stats = un[0]['reportResult']['stats']  где [0][1][2][3] stats stops trips stays


Unitsun = un

reportstats = Unitsun[0]['reportResult']['stats']
reportstatsdict = dict(reportstats)
reportstops = Unitsun[0]['reportResult']['tables'][0]['total']
reporttrips = Unitsun[0]['reportResult']['tables'][1]['total']

reporttripsdict = dict(reporttrips)
reportstays = Unitsun[0]['reportResult']['tables'][2]['total']

stops = Unitsun[1]
#trips = Unitsun[2]
trips = Unitsun[3]
stays = Unitsun[3]


# dateputlist
# orgaddr

# datestats = reportstats[2][1].split(" ")[0]
# print("data otcheta ", datestats)

datestats = reportstatsdict['Начало интервала'].split(" ")[0]
print("DATA OTCHETA ", datestats)

# markcar = reportstats[1]
# print("markaavto", markcar[1])

markcar = reportstatsdict['Объект']
print("markaavto", markcar)


# gosnum = reportstats[1]
# gosnum = gosnum[1].split(" ")
# gosnum = gosnum[0:4]
# print("Gosnomer", gosnum)

gosnum = reportstatsdict['Объект']
print("Gosnomer", gosnum)

# driver
# driverud
# driverpas
# pricep

# dtday
# dtmonth

# kmdo = reportstats[9]
# print("Probeg", kmdo[1])

kmdo = reportstatsdict['Пробег'].split(" ")
print("Probeg", kmdo[0])

# kmpos

# fuelstart = reportstats[4]
# print("Fuel na starte", fuelstart[1])

fuelstart = reportstatsdict['Нач. уровень'].split(" ")
print("Fuel na starte", fuelstart[0])

# fuelend = reportstats[5]
# print("Fuel v konce", fuelend[1])

fuelend = reportstatsdict['Конеч. уровень'].split(" ")
print("Fuel v konce", fuelend[0])

# fuelloss = reportstats[6]
# print("Potracheno fuel", fuelloss[1])

fuelloss = reportstatsdict['Потрачено топлива по ДУТ'].split(" ")
print("Potracheno fuel", fuelloss[0])

# motochas = reportstats[13]
# print("Motochas", motochas[1])

motochas = reportstatsdict['Моточасы']
print("Motochas", motochas)

# starttripstime = GetDataWialon.time_conver_tolocal(reporttrips[1])
# print("Start trips", starttripstime)

starttripstime = GetDataWialon.time_conver_tolocal(reporttrips[2])
print("Start trips", starttripstime)


temptrips = Unitsun[3][0]['c']
endtripstime = temptrips[1] + " " + temptrips[3]['t']

endtripstime = GetDataWialon.time_conver_tolocal(endtripstime)
print("End time trips", endtripstime)

# org
# addrin
# addrout
# addrs
# punkt


# Выезд из гаража
### 14,117  14,124   14,131   14,138    14,164
print(reporttrips[2])
starttripstime = str(GetDataWialon.time_conver_tolocal(reporttrips[2]))
starttripstime = starttripstime.split(" ")
starttripsdt = starttripstime[0].split("-")
starttripstm = starttripstime[1].split("+")[0]
print("Start trips", starttripstime)



# Прибытие в гараж
### 15,117  15,124   15,131   15,138    15,164
endtripstime = str(GetDataWialon.time_conver_tolocal(reporttrips[3]))
endtripstime = endtripstime.split(" ")
endtripsdt = endtripstime[0].split("-")
endtripstm = endtripstime[1].split("+")[0]
print("End time trips", endtripstime)








    r=7
    c=1
    cin = [38,48,58]
    cout =  [67,78]

    print(trips)


for item in trips:
    # Поездки
    # punkt = item['c'][7]['t'] прошлое значение
    print(item)
    punkt = item['c'][3]['t']
    print(punkt)  # Наименование пункта

    # # Прибытие
    # dtin = item['c'][1]['t'] прошлое значение
    dtin = item['c'][2]['t']
    punktin = str(GetDataWialon.time_conver_tolocal(dtin))
    punktin = punktin.split(" ")
    punktindt = punktin[0].split("-")
    punktintm = punktin[1].split(":")
    print(punktin)  # Время прибытия


    # Убытие
    dtout = item['c'][2]['t']
    punktout = str(GetDataWialon.time_conver_tolocal(dtout))
    punktout = punktout.split(" ")
    punktoutdt = punktout[0].split("-")
    punktouttm = punktout[1].split(":")
    print(punktout)  # Время убытия

    r = r + 1

















"""
Нужно
лист 1

дата путевого листа
Организация и месторосположени + телефон
Марка авто
ГосНомер
Водитель ФИО
Удостоверение водителя
Регистрационный номер
Прицеп номер
число | месяц | показание спидометра км | время выезда
число | месяц | показание спидометра км | время возвращения

в чьем распоряжении | где погрузил | где разгрузил

лист 2
пункты погрузки разгрузки киллометраж

"""
